package com.game.the_gallows_game.util;

import java.util.HashMap;
import java.util.Map;
import lombok.experimental.UtilityClass;

@UtilityClass
public class QuizUtil {

	public static Map<String, String> quizMap = new HashMap<>();

	static {
				quizMap.put("В каком городе не работал великий композитор 18-го века Кристоф Виллибальд Глюк?", "Берлин");
				quizMap.put("Кто первым доказал периодичность появления комет?", "Галлей");
				quizMap.put("С какой из этих стран Чехия не граничит?", "Венгрия");
				quizMap.put("Где в основном проживают таты?", "Дагестан");
				quizMap.put("Как, в переводе на русский язык, звучало бы название фильма 'Мимино'?", "Сокол");
				quizMap.put("Как называется курс парусного судна, совпадающий с направлением ветра?", "Фордевинд");
				quizMap.put("Какое брюхо, согласно спорной русской пословице, глухо к ученью?", "Сытое");
				quizMap.put("Кто считается основоположником кубизма?", "Пикассо");
				quizMap.put("Какая березка стояла во поле?", "Кудрявая");
				quizMap.put("Какой ресторан находится на углу Старого и Нового Арбата?", "Прага");
				quizMap.put("Какой вид березы славится красивой древесиной?", "Карельская");
				quizMap.put("Какую икру больше всего любил Джеймс Бонд?", "Белужью");
				quizMap.put("Какой цвет волос был у возлюбленной Тристана Изольды, если верить Бедье?", "Белокурый");
				quizMap.put("Одним из направлений какой религиозной философии является учение дзен?", "Буддизм");
				quizMap.put("В каком городе в 1932 году был проведён первый международный кинофестиваль?", "Венеция");
				quizMap.put("Слугa Aтoca", "гримо");
				quizMap.put("Kак имeнуетcя в юpиспpудeнции прoцecс раcсмотрeния дела?", "Судопроизводство");
				quizMap.put("Укажите синоним для слова «кожа»", "Эпидермис");
				quizMap.put("Самый сильный разработчик", "Шитиков");
				quizMap.put("Откуда родом поэт Федерико Гарсия Лорка?", "Испания");
				quizMap.put("С какой фигуры начинаются соревнования по городошному спорту?", "Пушка");
				quizMap.put("Сколько раз в сутки подзаводят часы на Спасской башне московского Кремля?", "Два");
				quizMap.put("Кто получил первую Нобелевскую премию по литературе?", "Поэт");
				quizMap.put("В честь какого растения область Фриули-Венеция-Джулия в Италии ежегодно проводит трёхмесячный фестиваль?", "спаржа");
				quizMap.put("Как \"в народе\" называют химическое соединение - тринитротолуол?", "Тротил");
				quizMap.put("У кого из \"вампиров\" кровь пьют только самки?", "Комары");
				quizMap.put("В русских сказках лисичка-сестричка, коза-дереза, а зайчик-... Кто?", "Побегайчик");
				quizMap.put("Какая российская автономия полностью окружена Краснодарским краем?", "Адыгея");
				quizMap.put("\tКакой рыболовной снастью ловил рыбу старик из сказки А.С. Пушкина \"Сказка о рыбаке и рыбке\"?", "Невод");
				quizMap.put("Какую позицию на поле называют \"голкипер\"?", "Вратарь");
				quizMap.put("Официальный язык государства Израиль?", "Иврит");
				quizMap.put("Как называется детеныш норки?", "Щенок");
				quizMap.put("От какого дерева появляются желуди?", "Дуб");
				quizMap.put("Как звали крысу в сказке \"Золотой ключик\"?", "Шушара");
				quizMap.put("Корюшка - это...", "Рыбка");
				quizMap.put("Кто был главным врагом трех поросят?", "Волк");
				quizMap.put("Какая планета совершает 1 оборот вокруг солнца со скоростью 47,9 км/с", "Меркурий");
				quizMap.put("Кем по образованию был Антон Павлович Чехов?", "Врач");
				quizMap.put("Как звали тонкого в рассказе А.П. Чехова «Толстый и тонкий»?", "Порфирий");
				quizMap.put("Рассказ А.П.Чехова о несчастном ревматике.", "Сапоги");
				quizMap.put("В каком итальянском городе была выведена известная порода комнатных собак?", "Болонья");
				quizMap.put("Какая рыба является самым крупным пресноводным хищником?", "Cом");
				quizMap.put("Президент какой республики в 1996 году был избран президентом ФИДЕ?", "Калмыкии");
				quizMap.put("Как звали младшего сына легендарного комдива Василия Ивановича Чапаева?", "Аркадий");
				quizMap.put("Чему равна сумма чисел от 0 до 100 включительно?", "5050");
				quizMap.put("Как называл народ медную монету в 3 копейки после 40 годов XIX века?", "Гривенный");
				quizMap.put("Какой европейский город раньше носил название Лютеция?", "Париж");
				quizMap.put("Сенатором какого штата был Ал Гор до того, как стал вице-президентом США?", "Теннесси");
				quizMap.put("Назовите греческого атлета, выигравшего марафон на Первой Олимпиаде нашего времени.", "Луис");
				quizMap.put("Кого из российских правителей называли \"русским Гамлетом\"", "Павел");
				quizMap.put("Что из перечисленного является единственным колониальным владением Британии в Европе?", "Гибралтар");
				quizMap.put("Облик какой женщины дошёл до наших дней благодаря скульптору Тутмесу?", "Нефертити");
				quizMap.put("Как назывался первый атомный ледокол СССР?", "Ленин");
				quizMap.put("В какой стране на население наводили ужас тонтон-макуты?", "Гаити");
				quizMap.put("Как называлась столица государства ацтеков?", "Теночтитлан");
				quizMap.put("Назовите административный центр (столицу) штата Флорида", "Таллахасси");
				quizMap.put("Что означает количество пятнышек у божьей коровки?", "Вид");
				quizMap.put("Игроков какой команды называют \"армейцами\"", "ЦСКА");
				quizMap.put("К какому семейству рыб принадлежит пескарь?", "Карповые");
				quizMap.put("Под каким названием всему миру была известна разведслужба бывшей ГДР?", "ШТАЗИ");
				quizMap.put("Сказочный Доктор?", "Айболит");
				quizMap.put("Куда отправляет Военкомат?", "Служить");
				quizMap.put("Растворитель для акварельных красок?", "Вода");
				quizMap.put("Что такое дельта реки?", "Устье");
				quizMap.put("Машинка для выравнивания грунта", "скрепер");
				quizMap.put("На какой вопрос никогда нельзя правда ответить \"Да\"?", "Спишь");
				quizMap.put("Какое воинское звание было у Хозе в опере \"Кармен\"", "Сержант");
				quizMap.put("Фамилия вокалиста Linkin Park", "Беннинтгон");
				quizMap.put("Много людей сопровождают в последний путь своего родственника/знакомого. Как это называется?", "похороны");
				quizMap.put("На какой реке стоит город Саратов?", "Волга");
				quizMap.put("В форме какого животного обычно делают копилки для монет?", "Свинья");
				quizMap.put("На окошке сидит кошка всё как у кошки но не кошка.", "кот");
				quizMap.put("Как по-научному называется питьевой спирт?", "Этанол");
				quizMap.put("В какой области науки проявились выдающиеся способности Софьи Ковалевской?", "Математика");
				quizMap.put("Из какого меxа сделаны шапки королевскиx гвардейцев Великобритании?", "Медвежий");
				quizMap.put("Назовите вслед за Н. В. Гоголем вторую беду России, кроме дорог ?", "Дураки");
				quizMap.put("Что у моряков называется камбузом?", "Кухня");
				quizMap.put("Как звали знаменитого мореплавателя Кука?", "Джеймс");
				quizMap.put("Как звали прославленного английского флотоводца Нельсона?", "Горацио");
				quizMap.put("Из какого злака получают манную крупу?", "пшеница");
				quizMap.put("Футболист какого амплуа изобрёл «удар скорпиона», отбив мяч в прыжке пятками?", "вратарь");
				quizMap.put("Главный герой какого романа Ф.М. Достоевского мечтал стать Ротшильдом?", "Подросток");
				quizMap.put("Как называется надпись на лицевой или оборотной стороне монеты, медали?", "Легенда");
				quizMap.put("Какой пистолет Остап Бендер обещал дать Кислярскому в романе «Двенадцать стульев»?", "парабеллум");
				quizMap.put("Какой чин имел Лукаш, у которого бравый солдат Швейк был денщиком?", "Поручик");
				quizMap.put("Какой крепёжный не имеет резьбы?", "шплинт");
				quizMap.put("Какой стране принадлежат Шантарские острова?", "Россия");
				quizMap.put("Какое животное изображено на гербе Челябинска", "Верблюд");
				quizMap.put("Денежная единица Узбекистана", "Сум");
				quizMap.put("Ден.единица ЮАР", "Рэнд");
				quizMap.put("Как называется русский традиционный пирог?", "Расстегай");
				quizMap.put("Какое произведение Моцарта было завершено другим композитором?", "Реквием");
	}

}
